docs/CS/Python/pandas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-13 Mon 09:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Building Criteria</a></li>
<li><a href="#orgheadline3">2. Selection</a>
<ul>
<li><a href="#orgheadline2">2.1. Using both row labels and value conditionals</a></li>
</ul>
</li>
<li><a href="#orgheadline4">3. MultiIndexing</a></li>
<li><a href="#orgheadline6">4. Grouping</a>
<ul>
<li><a href="#orgheadline5">4.1. Splitting an object into groups</a></li>
</ul>
</li>
<li><a href="#orgheadline15">5. MultiIndex / Advanced Indexing</a>
<ul>
<li><a href="#orgheadline9">5.1. Hierarchical indexing (MultiIndex)</a>
<ul>
<li><a href="#orgheadline8">5.1.1. Creating a MultiIndex (hierarchical index) object</a></li>
</ul>
</li>
<li><a href="#orgheadline14">5.2. Advanced indexing</a>
<ul>
<li><a href="#orgheadline10">5.2.1. Using slicers</a></li>
<li><a href="#orgheadline11">5.2.2. group by</a></li>
<li><a href="#orgheadline12">5.2.3. pivoting</a></li>
<li><a href="#orgheadline13">5.2.4. reshaping data</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline16">6. Panels</a></li>
<li><a href="#orgheadline63">7. xarray</a>
<ul>
<li><a href="#orgheadline20">7.1. Overview: Why xarray?</a>
<ul>
<li><a href="#orgheadline17">7.1.1. Features</a></li>
<li><a href="#orgheadline18">7.1.2. Core data structures</a></li>
<li><a href="#orgheadline19">7.1.3. Goals and aspirations</a></li>
</ul>
</li>
<li><a href="#orgheadline44">7.2. Examples</a>
<ul>
<li><a href="#orgheadline28">7.2.1. Quick overview</a></li>
<li><a href="#orgheadline34">7.2.2. Toy weather data</a></li>
<li><a href="#orgheadline39">7.2.3. Calculating Seasonal Averages from Timeseries of Monthly Means</a></li>
<li><a href="#orgheadline42">7.2.4. Working with Multidimensional Coordinates</a></li>
<li><a href="#orgheadline43">7.2.5. Recipes</a></li>
</ul>
</li>
<li><a href="#orgheadline47">7.3. Installation</a>
<ul>
<li><a href="#orgheadline45">7.3.1. For accelerating xarray</a></li>
<li><a href="#orgheadline46">7.3.2. For parallel computing</a></li>
</ul>
</li>
<li><a href="#orgheadline48">7.4. Data Structures</a></li>
<li><a href="#orgheadline49">7.5. Indexing and selecting data</a></li>
<li><a href="#orgheadline51">7.6. Computation</a>
<ul>
<li><a href="#orgheadline50">7.6.1. Rolling window operations</a></li>
</ul>
</li>
<li><a href="#orgheadline52">7.7. GroupBy: split-apply-combine</a></li>
<li><a href="#orgheadline53">7.8. Reshaping and reorganizing data</a></li>
<li><a href="#orgheadline54">7.9. Combining data</a></li>
<li><a href="#orgheadline56">7.10. Time series data</a>
<ul>
<li><a href="#orgheadline55">7.10.1. Datetime indexing</a></li>
</ul>
</li>
<li><a href="#orgheadline57">7.11. Working with pandas</a></li>
<li><a href="#orgheadline58">7.12. Serialization and IO</a></li>
<li><a href="#orgheadline59">7.13. Out of core computation with dask</a></li>
<li><a href="#orgheadline60">7.14. Plotting</a></li>
<li><a href="#orgheadline61">7.15. API reference</a></li>
<li><a href="#orgheadline62">7.16. xarray Internals</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Building Criteria</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Dynamically reduce a list of criteria using a binary operators</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">19</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">df</span> = pd.DataFrame<span style="color: #AE81FF;">(</span>
   ....:      <span style="color: #66D9EF;">{</span><span style="color: #E6DB74;">'AAA'</span> : <span style="color: #A6E22E;">[</span><span style="color: #AE81FF;">4</span>,<span style="color: #AE81FF;">5</span>,<span style="color: #AE81FF;">6</span>,<span style="color: #AE81FF;">7</span><span style="color: #A6E22E;">]</span>, <span style="color: #E6DB74;">'BBB'</span> : <span style="color: #A6E22E;">[</span><span style="color: #AE81FF;">10</span>,<span style="color: #AE81FF;">20</span>,<span style="color: #AE81FF;">30</span>,<span style="color: #AE81FF;">40</span><span style="color: #A6E22E;">]</span>,<span style="color: #E6DB74;">'CCC'</span> : <span style="color: #A6E22E;">[</span><span style="color: #AE81FF;">100</span>,<span style="color: #AE81FF;">50</span>,-<span style="color: #AE81FF;">30</span>,-<span style="color: #AE81FF;">50</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>; df
   ....:
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">19</span><span style="color: #AE81FF;">]</span>:
   AAA  BBB  CCC
<span style="color: #AE81FF;">0</span>    <span style="color: #AE81FF;">4</span>   <span style="color: #AE81FF;">10</span>  <span style="color: #AE81FF;">100</span>
<span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">5</span>   <span style="color: #AE81FF;">20</span>   <span style="color: #AE81FF;">50</span>
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">6</span>   <span style="color: #AE81FF;">30</span>  -<span style="color: #AE81FF;">30</span>
<span style="color: #AE81FF;">3</span>    <span style="color: #AE81FF;">7</span>   <span style="color: #AE81FF;">40</span>  -<span style="color: #AE81FF;">50</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">20</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">Crit1</span> = df.AAA &lt;= <span style="color: #AE81FF;">5</span>.<span style="color: #AE81FF;">5</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">21</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">Crit2</span> = df.BBB == <span style="color: #AE81FF;">10</span>.<span style="color: #AE81FF;">0</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">22</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">Crit3</span> = df.CCC &gt; -<span style="color: #AE81FF;">40</span>.<span style="color: #AE81FF;">0</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">24</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">CritList</span> = <span style="color: #AE81FF;">[</span>Crit1,Crit2,Crit3<span style="color: #AE81FF;">]</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">25</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">AllCrit</span> = functools.<span style="color: #F92672;">reduce</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">lambda</span> x,y: x &amp; y, CritList<span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">26</span><span style="color: #AE81FF;">]</span>: df<span style="color: #AE81FF;">[</span>AllCrit<span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">26</span><span style="color: #AE81FF;">]</span>:
   AAA  BBB  CCC
<span style="color: #AE81FF;">0</span>    <span style="color: #AE81FF;">4</span>   <span style="color: #AE81FF;">10</span>  <span style="color: #AE81FF;">100</span>
</pre>
</div>
</div>
</div>
