docs/CS/Python/pandas.html

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">2</span> Selection</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Using both row labels and value conditionals</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">27</span><span style="color: #AE81FF;">]</span>: df = pd.DataFrame<span style="color: #AE81FF;">(</span>
   ....:      {'AAA' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">4</span>,<span style="color: #AE81FF;">5</span>,<span style="color: #AE81FF;">6</span>,<span style="color: #AE81FF;">7</span><span style="color: #66D9EF;">]</span>, 'BBB' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">10</span>,<span style="color: #AE81FF;">20</span>,<span style="color: #AE81FF;">30</span>,<span style="color: #AE81FF;">40</span><span style="color: #66D9EF;">]</span>,'CCC' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">100</span>,<span style="color: #AE81FF;">50</span>,<span style="color: #AE81FF;">-30</span>,<span style="color: #AE81FF;">-50</span><span style="color: #66D9EF;">]</span>}<span style="color: #AE81FF;">)</span><span style="color: #75715E;">; </span><span style="color: #75715E;">df</span>
   ....:
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">27</span><span style="color: #AE81FF;">]</span>:
   AAA  BBB  CCC
<span style="color: #AE81FF;">0</span>    <span style="color: #AE81FF;">4</span>   <span style="color: #AE81FF;">10</span>  <span style="color: #AE81FF;">100</span>
<span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">5</span>   <span style="color: #AE81FF;">20</span>   <span style="color: #AE81FF;">50</span>
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">6</span>   <span style="color: #AE81FF;">30</span>  <span style="color: #AE81FF;">-30</span>
<span style="color: #AE81FF;">3</span>    <span style="color: #AE81FF;">7</span>   <span style="color: #AE81FF;">40</span>  <span style="color: #AE81FF;">-50</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">28</span><span style="color: #AE81FF;">]</span>: df<span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">(</span>df.AAA &lt;= <span style="color: #AE81FF;">6</span><span style="color: #66D9EF;">)</span> &amp; <span style="color: #66D9EF;">(</span>df.index.isin<span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">[</span><span style="color: #AE81FF;">0</span>,<span style="color: #AE81FF;">2</span>,<span style="color: #AE81FF;">4</span><span style="color: #E6DB74;">]</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">28</span><span style="color: #AE81FF;">]</span>:
   AAA  BBB  CCC
<span style="color: #AE81FF;">0</span>    <span style="color: #AE81FF;">4</span>   <span style="color: #AE81FF;">10</span>  <span style="color: #AE81FF;">100</span>
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">6</span>   <span style="color: #AE81FF;">30</span>  <span style="color: #AE81FF;">-30</span>
</pre>
</div>

<p>
There are 2 explicit slicing methods, with a third general case
</p>

<p>
Positional-oriented (Python slicing style : exclusive of end)
Label-oriented (Non-Python slicing style : inclusive of end)
General (Either slicing style : depends on if the slice contains labels or positions)
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">35</span><span style="color: #AE81FF;">]</span>: df2.iloc<span style="color: #AE81FF;">[</span>1:3<span style="color: #AE81FF;">]</span> #Position-oriented
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">35</span><span style="color: #AE81FF;">]</span>:
   AAA  BBB  CCC
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">5</span>   <span style="color: #AE81FF;">20</span>   <span style="color: #AE81FF;">50</span>
<span style="color: #AE81FF;">3</span>    <span style="color: #AE81FF;">6</span>   <span style="color: #AE81FF;">30</span>  <span style="color: #AE81FF;">-30</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">36</span><span style="color: #AE81FF;">]</span>: df2.loc<span style="color: #AE81FF;">[</span>1:3<span style="color: #AE81FF;">]</span> #Label-oriented
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">36</span><span style="color: #AE81FF;">]</span>:
   AAA  BBB  CCC
<span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">4</span>   <span style="color: #AE81FF;">10</span>  <span style="color: #AE81FF;">100</span>
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">5</span>   <span style="color: #AE81FF;">20</span>   <span style="color: #AE81FF;">50</span>
<span style="color: #AE81FF;">3</span>    <span style="color: #AE81FF;">6</span>   <span style="color: #AE81FF;">30</span>  <span style="color: #AE81FF;">-30</span>
</pre>
</div>

<p>
-New Columns
Efficiently and dynamically creating new columns using applymap.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">48</span><span style="color: #AE81FF;">]</span>: df = pd.DataFrame<span style="color: #AE81FF;">(</span>
   ....:      {'AAA' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">2</span>,<span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">3</span><span style="color: #66D9EF;">]</span>, 'BBB' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">2</span>,<span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">]</span>, 'CCC' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">2</span>,<span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">3</span>,<span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">]</span>}<span style="color: #AE81FF;">)</span><span style="color: #75715E;">; </span><span style="color: #75715E;">df</span>
   ....:
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">48</span><span style="color: #AE81FF;">]</span>:
   AAA  BBB  CCC
<span style="color: #AE81FF;">0</span>    <span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">2</span>
<span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">1</span>
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">3</span>
<span style="color: #AE81FF;">3</span>    <span style="color: #AE81FF;">3</span>    <span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">1</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">49</span><span style="color: #AE81FF;">]</span>: source_cols = df.columns # or some subset would work too.

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">50</span><span style="color: #AE81FF;">]</span>: new_cols = <span style="color: #AE81FF;">[</span>str<span style="color: #66D9EF;">(</span>x<span style="color: #66D9EF;">)</span> + <span style="color: #E6DB74;">"_cat"</span> for x in source_cols<span style="color: #AE81FF;">]</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">51</span><span style="color: #AE81FF;">]</span>: categories = {1 : 'Alpha', <span style="color: #AE81FF;">2</span> : 'Beta', <span style="color: #AE81FF;">3</span> : 'Charlie' }

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">52</span><span style="color: #AE81FF;">]</span>: df<span style="color: #AE81FF;">[</span>new_cols<span style="color: #AE81FF;">]</span> = df<span style="color: #AE81FF;">[</span>source_cols<span style="color: #AE81FF;">]</span>.applymap<span style="color: #AE81FF;">(</span>categories.get<span style="color: #AE81FF;">)</span><span style="color: #75715E;">;</span><span style="color: #75715E;">df</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">52</span><span style="color: #AE81FF;">]</span>:
   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
<span style="color: #AE81FF;">0</span>    <span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">2</span>    Alpha   Alpha     Beta
<span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">1</span>     Beta   Alpha    Alpha
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">3</span>    Alpha    Beta  Charlie
<span style="color: #AE81FF;">3</span>    <span style="color: #AE81FF;">3</span>    <span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">1</span>  Charlie    Beta    Alpha
</pre>
</div>
</div>
</div>
</div>
