docs/CS/Python/pandas.html

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">3</span> MultiIndexing</h2>
<div class="outline-text-2" id="text-3">
<p>
Creating a multi-index from a labeled frame
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">56</span><span style="color: #AE81FF;">]</span>: df = pd.DataFrame<span style="color: #AE81FF;">(</span>{'row' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">0</span>,<span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">]</span>,
   ....:                    'One_X' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">1.1</span>,<span style="color: #AE81FF;">1.1</span>,<span style="color: #AE81FF;">1.1</span><span style="color: #66D9EF;">]</span>,
   ....:                    'One_Y' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">1.2</span>,<span style="color: #AE81FF;">1.2</span>,<span style="color: #AE81FF;">1.2</span><span style="color: #66D9EF;">]</span>,
   ....:                    'Two_X' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">1.11</span>,<span style="color: #AE81FF;">1.11</span>,<span style="color: #AE81FF;">1.11</span><span style="color: #66D9EF;">]</span>,
   ....:                    'Two_Y' : <span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">1.22</span>,<span style="color: #AE81FF;">1.22</span>,<span style="color: #AE81FF;">1.22</span><span style="color: #66D9EF;">]</span>}<span style="color: #AE81FF;">)</span><span style="color: #75715E;">; </span><span style="color: #75715E;">df</span>
   ....:
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">56</span><span style="color: #AE81FF;">]</span>:
   One_X  One_Y  Two_X  Two_Y  row
<span style="color: #AE81FF;">0</span>    <span style="color: #AE81FF;">1.1</span>    <span style="color: #AE81FF;">1.2</span>   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>    <span style="color: #AE81FF;">0</span>
<span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">1.1</span>    <span style="color: #AE81FF;">1.2</span>   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>    <span style="color: #AE81FF;">1</span>
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">1.1</span>    <span style="color: #AE81FF;">1.2</span>   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>    <span style="color: #AE81FF;">2</span>

# As Labelled Index
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">57</span><span style="color: #AE81FF;">]</span>: df = df.set_index<span style="color: #AE81FF;">(</span>'row'<span style="color: #AE81FF;">)</span><span style="color: #75715E;">;</span><span style="color: #75715E;">df</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">57</span><span style="color: #AE81FF;">]</span>:
     One_X  One_Y  Two_X  Two_Y
row
<span style="color: #AE81FF;">0</span>      <span style="color: #AE81FF;">1.1</span>    <span style="color: #AE81FF;">1.2</span>   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>
<span style="color: #AE81FF;">1</span>      <span style="color: #AE81FF;">1.1</span>    <span style="color: #AE81FF;">1.2</span>   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>
<span style="color: #AE81FF;">2</span>      <span style="color: #AE81FF;">1.1</span>    <span style="color: #AE81FF;">1.2</span>   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>

# With Hierarchical Columns
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">58</span><span style="color: #AE81FF;">]</span>: df.columns = pd.MultiIndex.from_tuples<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span>tuple<span style="color: #A6E22E;">(</span>c.split<span style="color: #E6DB74;">(</span>'_'<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span> for c in df.columns<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span><span style="color: #75715E;">;</span><span style="color: #75715E;">df</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">58</span><span style="color: #AE81FF;">]</span>:
     One        Two
       X    Y     X     Y
row
<span style="color: #AE81FF;">0</span>    <span style="color: #AE81FF;">1.1</span>  <span style="color: #AE81FF;">1.2</span>  <span style="color: #AE81FF;">1.11</span>  <span style="color: #AE81FF;">1.22</span>
<span style="color: #AE81FF;">1</span>    <span style="color: #AE81FF;">1.1</span>  <span style="color: #AE81FF;">1.2</span>  <span style="color: #AE81FF;">1.11</span>  <span style="color: #AE81FF;">1.22</span>
<span style="color: #AE81FF;">2</span>    <span style="color: #AE81FF;">1.1</span>  <span style="color: #AE81FF;">1.2</span>  <span style="color: #AE81FF;">1.11</span>  <span style="color: #AE81FF;">1.22</span>
# Now stack &amp; Reset
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">59</span><span style="color: #AE81FF;">]</span>: df = df.stack<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">)</span>.reset_index<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span><span style="color: #75715E;">;</span><span style="color: #75715E;">df</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">59</span><span style="color: #AE81FF;">]</span>:
    level_1     X     Y
row
<span style="color: #AE81FF;">0</span>       One  <span style="color: #AE81FF;">1.10</span>  <span style="color: #AE81FF;">1.20</span>
<span style="color: #AE81FF;">0</span>       Two  <span style="color: #AE81FF;">1.11</span>  <span style="color: #AE81FF;">1.22</span>
<span style="color: #AE81FF;">1</span>       One  <span style="color: #AE81FF;">1.10</span>  <span style="color: #AE81FF;">1.20</span>
<span style="color: #AE81FF;">1</span>       Two  <span style="color: #AE81FF;">1.11</span>  <span style="color: #AE81FF;">1.22</span>
<span style="color: #AE81FF;">2</span>       One  <span style="color: #AE81FF;">1.10</span>  <span style="color: #AE81FF;">1.20</span>
<span style="color: #AE81FF;">2</span>       Two  <span style="color: #AE81FF;">1.11</span>  <span style="color: #AE81FF;">1.22</span>
# And fix the labels <span style="color: #AE81FF;">(</span>Notice the label 'level_1' got added automatically<span style="color: #AE81FF;">)</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">60</span><span style="color: #AE81FF;">]</span>: df.columns = <span style="color: #AE81FF;">[</span>'Sample','All_X','All_Y'<span style="color: #AE81FF;">]</span><span style="color: #75715E;">;</span><span style="color: #75715E;">df</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">60</span><span style="color: #AE81FF;">]</span>:
    Sample  All_X  All_Y
row
<span style="color: #AE81FF;">0</span>      One   <span style="color: #AE81FF;">1.10</span>   <span style="color: #AE81FF;">1.20</span>
<span style="color: #AE81FF;">0</span>      Two   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>
<span style="color: #AE81FF;">1</span>      One   <span style="color: #AE81FF;">1.10</span>   <span style="color: #AE81FF;">1.20</span>
<span style="color: #AE81FF;">1</span>      Two   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>
<span style="color: #AE81FF;">2</span>      One   <span style="color: #AE81FF;">1.10</span>   <span style="color: #AE81FF;">1.20</span>
<span style="color: #AE81FF;">2</span>      Two   <span style="color: #AE81FF;">1.11</span>   <span style="color: #AE81FF;">1.22</span>
</pre>
</div>

<ul class="org-ul">
<li>Slicing</li>
</ul>
<p>
Slicing a multi-index with xs
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">64</span><span style="color: #AE81FF;">]</span>: coords = <span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">(</span>'AA','one'<span style="color: #66D9EF;">)</span>,<span style="color: #66D9EF;">(</span>'AA','six'<span style="color: #66D9EF;">)</span>,<span style="color: #66D9EF;">(</span>'BB','one'<span style="color: #66D9EF;">)</span>,<span style="color: #66D9EF;">(</span>'BB','two'<span style="color: #66D9EF;">)</span>,<span style="color: #66D9EF;">(</span>'BB','six'<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">]</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">65</span><span style="color: #AE81FF;">]</span>: index = pd.MultiIndex.from_tuples<span style="color: #AE81FF;">(</span>coords<span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">66</span><span style="color: #AE81FF;">]</span>: df = pd.DataFrame<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">11</span>,<span style="color: #AE81FF;">22</span>,<span style="color: #AE81FF;">33</span>,<span style="color: #AE81FF;">44</span>,<span style="color: #AE81FF;">55</span><span style="color: #66D9EF;">]</span>,index,<span style="color: #66D9EF;">[</span>'MyData'<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span><span style="color: #75715E;">; </span><span style="color: #75715E;">df</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">66</span><span style="color: #AE81FF;">]</span>:
        MyData
AA one      <span style="color: #AE81FF;">11</span>
   six      <span style="color: #AE81FF;">22</span>
BB one      <span style="color: #AE81FF;">33</span>
   two      <span style="color: #AE81FF;">44</span>
   six      <span style="color: #AE81FF;">55</span>
</pre>
</div>
<p>
To take the cross section of the 1st level and 1st axis the index:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">67</span><span style="color: #AE81FF;">]</span>: df.xs<span style="color: #AE81FF;">(</span>'BB',level=0,axis=0<span style="color: #AE81FF;">)</span>  #Note : level and axis are optional, and default to zero
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">67</span><span style="color: #AE81FF;">]</span>:
     MyData
one      <span style="color: #AE81FF;">33</span>
two      <span style="color: #AE81FF;">44</span>
six      <span style="color: #AE81FF;">55</span>
</pre>
</div>

<p>
Slicing a multi-index with xs, method #2
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">69</span><span style="color: #AE81FF;">]</span>: index = list<span style="color: #AE81FF;">(</span>itertools.product<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">[</span>'Ada','Quinn','Violet'<span style="color: #A6E22E;">]</span>,<span style="color: #A6E22E;">[</span>'Comp','Math','Sci'<span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">70</span><span style="color: #AE81FF;">]</span>: headr = list<span style="color: #AE81FF;">(</span>itertools.product<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">[</span>'Exams','Labs'<span style="color: #A6E22E;">]</span>,<span style="color: #A6E22E;">[</span>'I','II'<span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">71</span><span style="color: #AE81FF;">]</span>: indx = pd.MultiIndex.from_tuples<span style="color: #AE81FF;">(</span>index,names=<span style="color: #66D9EF;">[</span>'Student','Course'<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">72</span><span style="color: #AE81FF;">]</span>: cols = pd.MultiIndex.from_tuples<span style="color: #AE81FF;">(</span>headr<span style="color: #AE81FF;">)</span> #Notice these are un-named

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">73</span><span style="color: #AE81FF;">]</span>: data = <span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">[</span>70+x+y+<span style="color: #A6E22E;">(</span>x*y<span style="color: #A6E22E;">)</span>%3 for x in range<span style="color: #A6E22E;">(</span><span style="color: #AE81FF;">4</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">]</span> for y in range<span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">9</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">]</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">74</span><span style="color: #AE81FF;">]</span>: df = pd.DataFrame<span style="color: #AE81FF;">(</span>data,indx,cols<span style="color: #AE81FF;">)</span><span style="color: #75715E;">; </span><span style="color: #75715E;">df</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">74</span><span style="color: #AE81FF;">]</span>:
               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      <span style="color: #AE81FF;">70</span>  <span style="color: #AE81FF;">71</span>   <span style="color: #AE81FF;">72</span>  <span style="color: #AE81FF;">73</span>
        Math      <span style="color: #AE81FF;">71</span>  <span style="color: #AE81FF;">73</span>   <span style="color: #AE81FF;">75</span>  <span style="color: #AE81FF;">74</span>
        Sci       <span style="color: #AE81FF;">72</span>  <span style="color: #AE81FF;">75</span>   <span style="color: #AE81FF;">75</span>  <span style="color: #AE81FF;">75</span>
Quinn   Comp      <span style="color: #AE81FF;">73</span>  <span style="color: #AE81FF;">74</span>   <span style="color: #AE81FF;">75</span>  <span style="color: #AE81FF;">76</span>
        Math      <span style="color: #AE81FF;">74</span>  <span style="color: #AE81FF;">76</span>   <span style="color: #AE81FF;">78</span>  <span style="color: #AE81FF;">77</span>
        Sci       <span style="color: #AE81FF;">75</span>  <span style="color: #AE81FF;">78</span>   <span style="color: #AE81FF;">78</span>  <span style="color: #AE81FF;">78</span>
Violet  Comp      <span style="color: #AE81FF;">76</span>  <span style="color: #AE81FF;">77</span>   <span style="color: #AE81FF;">78</span>  <span style="color: #AE81FF;">79</span>
        Math      <span style="color: #AE81FF;">77</span>  <span style="color: #AE81FF;">79</span>   <span style="color: #AE81FF;">81</span>  <span style="color: #AE81FF;">80</span>
        Sci       <span style="color: #AE81FF;">78</span>  <span style="color: #AE81FF;">81</span>   <span style="color: #AE81FF;">81</span>  <span style="color: #AE81FF;">81</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">75</span><span style="color: #AE81FF;">]</span>: All = slice<span style="color: #AE81FF;">(</span>None<span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">76</span><span style="color: #AE81FF;">]</span>: df.loc<span style="color: #AE81FF;">[</span>'Violet'<span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">76</span><span style="color: #AE81FF;">]</span>:
       Exams     Labs
           I  II    I  II
Course
Comp      <span style="color: #AE81FF;">76</span>  <span style="color: #AE81FF;">77</span>   <span style="color: #AE81FF;">78</span>  <span style="color: #AE81FF;">79</span>
Math      <span style="color: #AE81FF;">77</span>  <span style="color: #AE81FF;">79</span>   <span style="color: #AE81FF;">81</span>  <span style="color: #AE81FF;">80</span>
Sci       <span style="color: #AE81FF;">78</span>  <span style="color: #AE81FF;">81</span>   <span style="color: #AE81FF;">81</span>  <span style="color: #AE81FF;">81</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">77</span><span style="color: #AE81FF;">]</span>: df.loc<span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">(</span>All,'Math'<span style="color: #66D9EF;">)</span>,All<span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">77</span><span style="color: #AE81FF;">]</span>:
               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      <span style="color: #AE81FF;">71</span>  <span style="color: #AE81FF;">73</span>   <span style="color: #AE81FF;">75</span>  <span style="color: #AE81FF;">74</span>
Quinn   Math      <span style="color: #AE81FF;">74</span>  <span style="color: #AE81FF;">76</span>   <span style="color: #AE81FF;">78</span>  <span style="color: #AE81FF;">77</span>
Violet  Math      <span style="color: #AE81FF;">77</span>  <span style="color: #AE81FF;">79</span>   <span style="color: #AE81FF;">81</span>  <span style="color: #AE81FF;">80</span>

# get I
df.loc<span style="color: #AE81FF;">[</span>:, <span style="color: #66D9EF;">(</span>slice<span style="color: #A6E22E;">(</span>None<span style="color: #A6E22E;">)</span>, 'I'<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">]</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">78</span><span style="color: #AE81FF;">]</span>: df.loc<span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">(</span>slice<span style="color: #A6E22E;">(</span>'Ada','Quinn'<span style="color: #A6E22E;">)</span>,'Math'<span style="color: #66D9EF;">)</span>,All<span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">78</span><span style="color: #AE81FF;">]</span>:
               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      <span style="color: #AE81FF;">71</span>  <span style="color: #AE81FF;">73</span>   <span style="color: #AE81FF;">75</span>  <span style="color: #AE81FF;">74</span>
Quinn   Math      <span style="color: #AE81FF;">74</span>  <span style="color: #AE81FF;">76</span>   <span style="color: #AE81FF;">78</span>  <span style="color: #AE81FF;">77</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">79</span><span style="color: #AE81FF;">]</span>: df.loc<span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">(</span>All,'Math'<span style="color: #66D9EF;">)</span>,<span style="color: #66D9EF;">(</span>'Exams'<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">79</span><span style="color: #AE81FF;">]</span>:
                 I  II
Student Course
Ada     Math    <span style="color: #AE81FF;">71</span>  <span style="color: #AE81FF;">73</span>
Quinn   Math    <span style="color: #AE81FF;">74</span>  <span style="color: #AE81FF;">76</span>
Violet  Math    <span style="color: #AE81FF;">77</span>  <span style="color: #AE81FF;">79</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">80</span><span style="color: #AE81FF;">]</span>: df.loc<span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">(</span>All,'Math'<span style="color: #66D9EF;">)</span>,<span style="color: #66D9EF;">(</span>All,'II'<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">80</span><span style="color: #AE81FF;">]</span>:
               Exams Labs
                  II   II
Student Course
Ada     Math      <span style="color: #AE81FF;">73</span>   <span style="color: #AE81FF;">74</span>
Quinn   Math      <span style="color: #AE81FF;">76</span>   <span style="color: #AE81FF;">77</span>
Violet  Math      <span style="color: #AE81FF;">79</span>   <span style="color: #AE81FF;">80</span>
</pre>
</div>
<ul class="org-ul">
<li>Sorting</li>
</ul>
<p>
Sort by specific column or an ordered list of columns, with a multi-index.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"></pre>
</div>

<ul class="org-ul">
<li>pivoting a table to multi-index dataframe:</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"># get a pivot table, setting industry and symbol for two levels on the column
df_pivot_industries_asset_weights = pd.pivot_table<span style="color: #AE81FF;">(</span>
    df_industries_asset_weight, values='value', index=<span style="color: #66D9EF;">[</span>'date'<span style="color: #66D9EF;">]</span>,
    columns=<span style="color: #66D9EF;">[</span>'industry', 'symbol'<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>

# pivot the original dataframe to multi-index dataframe
# level <span style="color: #AE81FF;">0</span> value: industry
# level <span style="color: #AE81FF;">1</span> value: assets, the order of assets are changed.
df_pivot_industries_asset_weights = df_pivot_industries_asset_weights.fillna<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">)</span>
idx_level_0_value = df_pivot_industries_asset_weights.columns.get_level_values<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">)</span>
idx_level_0_value = idx_level_0_value.drop_duplicates<span style="color: #AE81FF;">()</span>
idx_level_1_value = df_pivot_industries_asset_weights.columns.get_level_values<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
