CS/Python/pandas.org
* Panels
- Extend a panel frame by transposing, adding a new dimension, and transposing back to the original dimensions.
#+begin_src emacs-lisp :tangle yes
In [43]: pf = pd.Panel({'df1':df1,'df2':df2,'df3':df3});pf
Out[43]:
<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 100 (major_axis) x 4 (minor_axis)
Items axis: df1 to df3
Major_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00
Minor_axis axis: A to D
#+end_src

- Create panels from dictionary:
#+BEGIN_SRC python
    panel_model = pd.Panel({target_date: get_factor_exposure(model, factors, target_date,
                            asset_weight.columns).T for target_date in asset_weight.index})

#+END_SRC

- panel multipying:
#+BEGIN_SRC python
datetimeindex = multiplicand.index.intersection(multiplier_panel.items)

product = pd.DataFrame(data=np.nan, index=datetimeindex, columns=multiplier_panel.major_axis)
for target_date in datetimeindex:
product.ix[target_date] = multiplier_panel[target_date].loc[:,multiplicand.columns].fillna(0).dot(multiplicand.ix[target_date].fillna(0))

#+END_SRC

- selcting&slicing:
usually:
items: datetimeindex

Major_axis: factors

Minor_axis: symbols
#+BEGIN_SRC python
panel.loc[datetime]
panel.major_xs(panel.major_axis[2:5])

panel.minor_axis

panel.minor_xs(['A', 'B', 'C'])
#+END_SRC
* xarray
** Overview: Why xarray?

*** Features
Adding dimensions names and coordinate indexes to numpy’s ndarray.

- Apply operations over dimensions by name: x.sum('time').
- Select values by label instead of integer location: x.loc['2014-01-01'] or x.sel(time='2014-01-01').
- Mathematical operations (e.g., x - y) vectorize across multiple dimensions (array broadcasting) based on dimension names, not shape.
- Flexible split-apply-combine operations with groupby: x.groupby('time.dayofyear').mean().
- Database like alignment based on coordinate labels that smoothly handles missing values: x, y = xr.align(x, y, join='outer').
- Keep track of arbitrary metadata in the form of a Python dictionary: x.attrs.

*** Core data structures
xarray has two core data structures. Both are fundamentally N-dimensional:

- DataArray is our implementation of a labeled, N-dimensional array. It is an N-D generalization of a pandas.Series. The name DataArray itself is borrowed from Fernando Perez’s datarray project, which prototyped a similar data structure.
- Dataset is a multi-dimensional, in-memory array database. It is a dict-like container of DataArray objects aligned along any number of shared dimensions, and serves a similar purpose in xarray to the pandas.DataFrame.
The power of the dataset over a plain dictionary is that, in addition to pulling out arrays by name, it is possible to select or combine data along a dimension across all arrays simultaneously.
Like a DataFrame, datasets facilitate array operations with heterogeneous data – the difference is that the arrays in a dataset can not only have different data types, but can also have different numbers of dimensions.


*** Goals and aspirations
pandas excels at working with tabular data. That suffices for many statistical analyses, but physical scientists rely on N-dimensional arrays – which is where xarray comes in.

xarray aims to provide a data analysis toolkit as powerful as pandas but designed for working with homogeneous N-dimensional arrays instead of tabular data.

Importantly, xarray has robust support for converting its objects to and from a numpy ndarray or a pandas DataFrame or Series, providing compatibility with the full PyData ecosystem.

** Examples
*** Quick overview
#+BEGIN_SRC python
import xarray as xr
#+END_SRC
