docs/CS/Python/pandas.html
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">5.2.2</span> group by</h4>
</div>

<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">5.2.3</span> pivoting</h4>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">5.2.4</span> reshaping data</h4>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">6</span> Panels</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Extend a panel frame by transposing, adding a new dimension, and transposing back to the original dimensions.</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">43</span><span style="color: #AE81FF;">]</span>: pf = pd.Panel<span style="color: #AE81FF;">(</span>{'df1'<span style="color: #F92672;">:df1</span>,'df2'<span style="color: #F92672;">:df2</span>,'df3'<span style="color: #F92672;">:df3}</span><span style="color: #AE81FF;">)</span><span style="color: #75715E;">;</span><span style="color: #75715E;">pf</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">43</span><span style="color: #AE81FF;">]</span>:
&lt;class 'pandas.core.panel.Panel'&gt;
Dimensions: <span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">(</span>items<span style="color: #AE81FF;">)</span> x <span style="color: #AE81FF;">100</span> <span style="color: #AE81FF;">(</span>major_axis<span style="color: #AE81FF;">)</span> x <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">(</span>minor_axis<span style="color: #AE81FF;">)</span>
Items axis: df1 to df3
Major_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00
Minor_axis axis: A to D
</pre>
</div>

<ul class="org-ul">
<li>Create panels from dictionary:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">panel_model</span> = pd.Panel<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">{</span>target_date: get_factor_exposure<span style="color: #A6E22E;">(</span>model, factors, target_date,
                        asset_weight.columns<span style="color: #A6E22E;">)</span>.T <span style="color: #F92672;">for</span> target_date <span style="color: #F92672;">in</span> asset_weight.index<span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>panel multipying:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">datetimeindex</span> = multiplicand.index.intersection<span style="color: #AE81FF;">(</span>multiplier_panel.items<span style="color: #AE81FF;">)</span>

<span style="color: #FD971F;">product</span> = pd.DataFrame<span style="color: #AE81FF;">(</span>data=np.nan, index=datetimeindex, columns=multiplier_panel.major_axis<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">for</span> target_date <span style="color: #F92672;">in</span> datetimeindex:
<span style="color: #FD971F;">product.ix</span><span style="color: #AE81FF;">[</span>target_date<span style="color: #AE81FF;">]</span> = multiplier_panel<span style="color: #AE81FF;">[</span>target_date<span style="color: #AE81FF;">]</span>.loc<span style="color: #AE81FF;">[</span>:,multiplicand.columns<span style="color: #AE81FF;">]</span>.fillna<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">)</span>.dot<span style="color: #AE81FF;">(</span>multiplicand.ix<span style="color: #66D9EF;">[</span>target_date<span style="color: #66D9EF;">]</span>.fillna<span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>selcting&amp;slicing:</li>
</ul>
<p>
usually:
items: datetimeindex
</p>

<p>
Major_axis: factors
</p>

<p>
Minor_axis: symbols
</p>
<div class="org-src-container">

<pre class="src src-python">panel.loc<span style="color: #AE81FF;">[</span>datetime<span style="color: #AE81FF;">]</span>
panel.major_xs<span style="color: #AE81FF;">(</span>panel.major_axis<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">2</span>:<span style="color: #AE81FF;">5</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>

panel.minor_axis

panel.minor_xs<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'A'</span>, <span style="color: #E6DB74;">'B'</span>, <span style="color: #E6DB74;">'C'</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline63" class="outline-2">
<h2 id="orgheadline63"><span class="section-number-2">7</span> xarray</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">7.1</span> Overview: Why xarray?</h3>
<div class="outline-text-3" id="text-7-1">
</div><div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">7.1.1</span> Features</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Adding dimensions names and coordinate indexes to numpys ndarray.
</p>

<ul class="org-ul">
<li>Apply operations over dimensions by name: x.sum('time').</li>
<li>Select values by label instead of integer location: x.loc['2014-01-01'] or x.sel(time='2014-01-01').</li>
<li>Mathematical operations (e.g., x - y) vectorize across multiple dimensions (array broadcasting) based on dimension names, not shape.</li>
<li>Flexible split-apply-combine operations with groupby: x.groupby('time.dayofyear').mean().</li>
<li>Database like alignment based on coordinate labels that smoothly handles missing values: x, y = xr.align(x, y, join='outer').</li>
<li>Keep track of arbitrary metadata in the form of a Python dictionary: x.attrs.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">7.1.2</span> Core data structures</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
xarray has two core data structures. Both are fundamentally N-dimensional:
</p>

<ul class="org-ul">
<li>DataArray is our implementation of a labeled, N-dimensional array. It is an N-D generalization of a pandas.Series. The name DataArray itself is borrowed from Fernando Perezs datarray project, which prototyped a similar data structure.</li>
<li>Dataset is a multi-dimensional, in-memory array database. It is a dict-like container of DataArray objects aligned along any number of shared dimensions, and serves a similar purpose in xarray to the pandas.DataFrame.</li>
</ul>
<p>
The power of the dataset over a plain dictionary is that, in addition to pulling out arrays by name, it is possible to select or combine data along a dimension across all arrays simultaneously.
Like a DataFrame, datasets facilitate array operations with heterogeneous data  the difference is that the arrays in a dataset can not only have different data types, but can also have different numbers of dimensions.
</p>
</div>
</div>


<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">7.1.3</span> Goals and aspirations</h4>
<div class="outline-text-4" id="text-7-1-3">
<p>
pandas excels at working with tabular data. That suffices for many statistical analyses, but physical scientists rely on N-dimensional arrays  which is where xarray comes in.
</p>

<p>
xarray aims to provide a data analysis toolkit as powerful as pandas but designed for working with homogeneous N-dimensional arrays instead of tabular data.
</p>

<p>
Importantly, xarray has robust support for converting its objects to and from a numpy ndarray or a pandas DataFrame or Series, providing compatibility with the full PyData ecosystem.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">7.2</span> Examples</h3>
<div class="outline-text-3" id="text-7-2">
</div><div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">7.2.1</span> Quick overview</h4>
<div class="outline-text-4" id="text-7-2-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">import</span> xarray <span style="color: #F92672;">as</span> xr
</pre>
</div>
</div>
