docs/CS/Python/pandas.html
<ol class="org-ol"><li><a id="orgheadline21"></a>Create a DataArray<br  /><div class="outline-text-5" id="text-7-2-1-1">
<p>
You can make a DataArray from scratch by supplying data in the form of a numpy array or list, with optional dimensions and coordinates:
</p>
<div class="org-src-container">

<pre class="src src-python">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">]</span>: xr.DataArray<span style="color: #AE81FF;">(</span>np.random.randn<span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">3</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #AE81FF;">(</span>dim_0: <span style="color: #AE81FF;">2</span>, dim_1: <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span> <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">643563</span>, -<span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">469388</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">357021</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">6746</span>  , -<span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">776904</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">968914</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Dimensions without coordinates: dim_0, dim_1

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">data</span> = xr.DataArray<span style="color: #AE81FF;">(</span>np.random.randn<span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">3</span><span style="color: #66D9EF;">)</span>, coords=<span style="color: #66D9EF;">{</span><span style="color: #E6DB74;">'x'</span>: <span style="color: #A6E22E;">[</span><span style="color: #E6DB74;">'a'</span>, <span style="color: #E6DB74;">'b'</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">}</span>, dims=<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">'x'</span>, <span style="color: #E6DB74;">'y'</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">6</span><span style="color: #AE81FF;">]</span>: data
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">6</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #AE81FF;">(</span>x: <span style="color: #AE81FF;">2</span>, y: <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">294524</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">413738</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">276662</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">472035</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">01396</span> , -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">362543</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * x        <span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'a'</span> <span style="color: #E6DB74;">'b'</span>
Dimensions without coordinates: y
</pre>
</div>
<p>
the key properties for a DataArray:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">like in pandas, values is a numpy array that you can modify in-place</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">8</span><span style="color: #AE81FF;">]</span>: data.values
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">8</span><span style="color: #AE81FF;">]</span>:
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">295</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">414</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">277</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">472</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">014</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">363</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">9</span><span style="color: #AE81FF;">]</span>: data.dims
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">9</span><span style="color: #AE81FF;">]</span>: <span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'x'</span>, <span style="color: #E6DB74;">'y'</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">]</span>: data.coords
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">]</span>:
Coordinates:
  * x        <span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'a'</span> <span style="color: #E6DB74;">'b'</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">you can use this dictionary to store arbitrary metadata</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">11</span><span style="color: #AE81FF;">]</span>: data.attrs
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">11</span><span style="color: #AE81FF;">]</span>: OrderedDict<span style="color: #AE81FF;">()</span>
</pre>
</div>
</div></li>
