docs/CS/Python/pandas.html

<li><a id="orgheadline22"></a>Indexing<br  /><div class="outline-text-5" id="text-7-2-1-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">positional and by integer label, like numpy</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">12</span><span style="color: #AE81FF;">]</span>: data<span style="color: #AE81FF;">[</span><span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">0</span>, <span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">12</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #AE81FF;">(</span>x: <span style="color: #AE81FF;">2</span>, y: <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">294524</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">413738</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">276662</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">472035</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">01396</span> , -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">362543</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * x        <span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'a'</span> <span style="color: #E6DB74;">'b'</span>
Dimensions without coordinates: y

<span style="color: #75715E;"># </span><span style="color: #75715E;">positional and by coordinate label, like pandas</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">13</span><span style="color: #AE81FF;">]</span>: data.loc<span style="color: #AE81FF;">[</span><span style="color: #E6DB74;">'a'</span>:<span style="color: #E6DB74;">'b'</span><span style="color: #AE81FF;">]</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">13</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #AE81FF;">(</span>x: <span style="color: #AE81FF;">2</span>, y: <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">294524</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">413738</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">276662</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">472035</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">01396</span> , -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">362543</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * x        <span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'a'</span> <span style="color: #E6DB74;">'b'</span>
Dimensions without coordinates: y

<span style="color: #75715E;"># </span><span style="color: #75715E;">by dimension name and integer label</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">14</span><span style="color: #AE81FF;">]</span>: data.isel<span style="color: #AE81FF;">(</span>x=<span style="color: #F92672;">slice</span><span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">14</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #AE81FF;">(</span>x: <span style="color: #AE81FF;">2</span>, y: <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">294524</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">413738</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">276662</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">472035</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">01396</span> , -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">362543</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * x        <span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'a'</span> <span style="color: #E6DB74;">'b'</span>
Dimensions without coordinates: y

<span style="color: #75715E;"># </span><span style="color: #75715E;">by dimension name and coordinate label</span>
In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">15</span><span style="color: #AE81FF;">]</span>: data.sel<span style="color: #AE81FF;">(</span>x=<span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'a'</span>, <span style="color: #E6DB74;">'b'</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">15</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #AE81FF;">(</span>x: <span style="color: #AE81FF;">2</span>, y: <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">294524</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">413738</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">276662</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">472035</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">01396</span> , -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">362543</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * x        <span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'a'</span> <span style="color: #E6DB74;">'b'</span>
Dimensions without coordinates: y
</pre>
</div>
</div></li>
<li><a id="orgheadline23"></a>Computation<br  /></li>
<li><a id="orgheadline24"></a>GroupBy<br  /><div class="outline-text-5" id="text-7-2-1-4">
<div class="org-src-container">

<pre class="src src-python">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">28</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">labels</span> = xr.DataArray<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'E'</span>, <span style="color: #E6DB74;">'F'</span>, <span style="color: #E6DB74;">'E'</span><span style="color: #66D9EF;">]</span>, <span style="color: #66D9EF;">[</span>data.coords<span style="color: #A6E22E;">[</span><span style="color: #E6DB74;">'y'</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span>, name=<span style="color: #E6DB74;">'labels'</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">29</span><span style="color: #AE81FF;">]</span>: labels
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">29</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #E6DB74;">'labels'</span> <span style="color: #AE81FF;">(</span>y: <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'E'</span>, <span style="color: #E6DB74;">'F'</span>, <span style="color: #E6DB74;">'E'</span><span style="color: #66D9EF;">]</span>,
      dtype=<span style="color: #E6DB74;">'&lt;U1'</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * y        <span style="color: #AE81FF;">(</span>y<span style="color: #AE81FF;">)</span> int64 <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">2</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">30</span><span style="color: #AE81FF;">]</span>: data.groupby<span style="color: #AE81FF;">(</span>labels<span style="color: #AE81FF;">)</span>.mean<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'y'</span><span style="color: #AE81FF;">)</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">30</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #AE81FF;">(</span>x: <span style="color: #AE81FF;">2</span>, labels: <span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">508931</span>,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">413738</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span>-<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">417289</span>, -<span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">01396</span> <span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * x        <span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'a'</span> <span style="color: #E6DB74;">'b'</span>
  * labels   <span style="color: #AE81FF;">(</span>labels<span style="color: #AE81FF;">)</span> <span style="color: #F92672;">object</span> <span style="color: #E6DB74;">'E'</span> <span style="color: #E6DB74;">'F'</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">31</span><span style="color: #AE81FF;">]</span>: data.groupby<span style="color: #AE81FF;">(</span>labels<span style="color: #AE81FF;">)</span>.<span style="color: #F92672;">apply</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">lambda</span> x: x - x.<span style="color: #F92672;">min</span><span style="color: #66D9EF;">()</span><span style="color: #AE81FF;">)</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">31</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.DataArray <span style="color: #AE81FF;">(</span>x: <span style="color: #AE81FF;">2</span>, y: <span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">)</span>&gt;
array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span><span style="color: #A6E22E;">[</span> <span style="color: #AE81FF;">0</span>.      ,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">427698</span>,  <span style="color: #AE81FF;">1</span>.<span style="color: #AE81FF;">571185</span><span style="color: #A6E22E;">]</span>,
       <span style="color: #A6E22E;">[</span> <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">822489</span>,  <span style="color: #AE81FF;">0</span>.      ,  <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">931981</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * x        <span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'a'</span> <span style="color: #E6DB74;">'b'</span>
  * y        <span style="color: #AE81FF;">(</span>y<span style="color: #AE81FF;">)</span> int64 <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">2</span>
    labels   <span style="color: #AE81FF;">(</span>y<span style="color: #AE81FF;">)</span> &lt;U1 <span style="color: #E6DB74;">'E'</span> <span style="color: #E6DB74;">'F'</span> <span style="color: #E6DB74;">'E'</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline25"></a>pandas<br  /></li>
<li><a id="orgheadline26"></a>Datasets<br  /></li>
<li><a id="orgheadline27"></a>NetCDF<br  /></li></ol>
</div>
<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">7.2.2</span> Toy weather data</h4>
<div class="outline-text-4" id="text-7-2-2">
</div><ol class="org-ol"><li><a id="orgheadline29"></a>Examine a dataset with pandas and seaborn<br  /></li>
<li><a id="orgheadline30"></a>Probability of freeze by calendar month<br  /></li>
