CS/Python/pandas.org
**** Monthly averaging
**** Calculate monthly anomalies
**** Fill missing values with climatology
*** Calculating Seasonal Averages from Timeseries of Monthly Means
**** Some calendar information so we can support any netCDF calendar.
**** A few calendar functions to determine the number of days in each month
**** Open the Dataset
**** Now for the heavy lifting:
*** Working with Multidimensional Coordinates
**** Plotting
**** Multidimensional Groupby
*** Recipes

** Installation
*** For accelerating xarray
bottleneck: speeds up NaN-skipping and rolling window aggregations by a large factor (1.0 or later)
*** For parallel computing
dask.array (0.9.0 or later): required for Out of core computation with dask.
** Data Structures
** Indexing and selecting data
| Dimension lookup | 	Index lookup | 	DataArray syntax                                 | 	Dataset syntax                                 |
| Positional       | 	By integer   | 	arr[:, 0]	                                      | not available                                    |
| Positional       | 	By label     | 	arr.loc[:, 'IA']	                               | not available                                    |
| By name          | 	By integer   | 	arr.isel(space=0) or arr[dict(space=0)]          | 	ds.isel(space=0) or ds[dict(space=0)]          |
| By name          | 	By label     | 	arr.sel(space='IA') or arr.loc[dict(space='IA')] | 	ds.sel(space='IA') or ds.loc[dict(space='IA')] |

** Computation
*** Rolling window operations

** GroupBy: split-apply-combine
** Reshaping and reorganizing data
** Combining data
** Time series data
*** Datetime indexing
#+BEGIN_SRC python
In [8]: time = pd.date_range('2000-01-01', freq='H', periods=365 * 24)

In [9]: ds = xr.Dataset({'foo': ('time', np.arange(365 * 24)), 'time': time})

In [10]: ds.sel(time='2000-01')
Out[10]:
<xarray.Dataset>
Dimensions:  (time: 744)
Coordinates:
  * time     (time) datetime64[ns] 2000-01-01 2000-01-01T01:00:00 ...
Data variables:
    foo      (time) int64 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 ...

In [11]: ds.sel(time=slice('2000-06-01', '2000-06-10'))
Out[11]:
<xarray.Dataset>
Dimensions:  (time: 240)
Coordinates:
  * time     (time) datetime64[ns] 2000-06-01 2000-06-01T01:00:00 ...
Data variables:
    foo      (time) int64 3648 3649 3650 3651 3652 3653 3654 3655 3656 3657 ...
#+END_SRC
** Working with pandas
** Serialization and IO
** Out of core computation with dask
** Plotting
** API reference
** xarray Internals
