docs/CS/Python/pandas.html
<li><a id="orgheadline31"></a>Monthly averaging<br  /></li>
<li><a id="orgheadline32"></a>Calculate monthly anomalies<br  /></li>
<li><a id="orgheadline33"></a>Fill missing values with climatology<br  /></li></ol>
</div>
<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">7.2.3</span> Calculating Seasonal Averages from Timeseries of Monthly Means</h4>
<div class="outline-text-4" id="text-7-2-3">
</div><ol class="org-ol"><li><a id="orgheadline35"></a>Some calendar information so we can support any netCDF calendar.<br  /></li>
<li><a id="orgheadline36"></a>A few calendar functions to determine the number of days in each month<br  /></li>
<li><a id="orgheadline37"></a>Open the Dataset<br  /></li>
<li><a id="orgheadline38"></a>Now for the heavy lifting:<br  /></li></ol>
</div>
<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42"><span class="section-number-4">7.2.4</span> Working with Multidimensional Coordinates</h4>
<div class="outline-text-4" id="text-7-2-4">
</div><ol class="org-ol"><li><a id="orgheadline40"></a>Plotting<br  /></li>
<li><a id="orgheadline41"></a>Multidimensional Groupby<br  /></li></ol>
</div>
<div id="outline-container-orgheadline43" class="outline-4">
<h4 id="orgheadline43"><span class="section-number-4">7.2.5</span> Recipes</h4>
</div>
</div>

<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">7.3</span> Installation</h3>
<div class="outline-text-3" id="text-7-3">
</div><div id="outline-container-orgheadline45" class="outline-4">
<h4 id="orgheadline45"><span class="section-number-4">7.3.1</span> For accelerating xarray</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
bottleneck: speeds up NaN-skipping and rolling window aggregations by a large factor (1.0 or later)
</p>
</div>
</div>
<div id="outline-container-orgheadline46" class="outline-4">
<h4 id="orgheadline46"><span class="section-number-4">7.3.2</span> For parallel computing</h4>
<div class="outline-text-4" id="text-7-3-2">
<p>
dask.array (0.9.0 or later): required for Out of core computation with dask.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline48" class="outline-3">
<h3 id="orgheadline48"><span class="section-number-3">7.4</span> Data Structures</h3>
</div>
<div id="outline-container-orgheadline49" class="outline-3">
<h3 id="orgheadline49"><span class="section-number-3">7.5</span> Indexing and selecting data</h3>
<div class="outline-text-3" id="text-7-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Dimension lookup</td>
<td class="org-left">Index lookup</td>
<td class="org-left">DataArray syntax</td>
<td class="org-left">Dataset syntax</td>
</tr>

<tr>
<td class="org-left">Positional</td>
<td class="org-left">By integer</td>
<td class="org-left">arr[:, 0]</td>
<td class="org-left">not available</td>
</tr>

<tr>
<td class="org-left">Positional</td>
<td class="org-left">By label</td>
<td class="org-left">arr.loc[:, 'IA']</td>
<td class="org-left">not available</td>
</tr>

<tr>
<td class="org-left">By name</td>
<td class="org-left">By integer</td>
<td class="org-left">arr.isel(space=0) or arr[dict(space=0)]</td>
<td class="org-left">ds.isel(space=0) or ds[dict(space=0)]</td>
</tr>

<tr>
<td class="org-left">By name</td>
<td class="org-left">By label</td>
<td class="org-left">arr.sel(space='IA') or arr.loc[dict(space='IA')]</td>
<td class="org-left">ds.sel(space='IA') or ds.loc[dict(space='IA')]</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">7.6</span> Computation</h3>
<div class="outline-text-3" id="text-7-6">
</div><div id="outline-container-orgheadline50" class="outline-4">
<h4 id="orgheadline50"><span class="section-number-4">7.6.1</span> Rolling window operations</h4>
</div>
</div>

<div id="outline-container-orgheadline52" class="outline-3">
<h3 id="orgheadline52"><span class="section-number-3">7.7</span> GroupBy: split-apply-combine</h3>
</div>
<div id="outline-container-orgheadline53" class="outline-3">
<h3 id="orgheadline53"><span class="section-number-3">7.8</span> Reshaping and reorganizing data</h3>
</div>
<div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">7.9</span> Combining data</h3>
</div>
<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">7.10</span> Time series data</h3>
<div class="outline-text-3" id="text-7-10">
</div><div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">7.10.1</span> Datetime indexing</h4>
<div class="outline-text-4" id="text-7-10-1">
<div class="org-src-container">

<pre class="src src-python">In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">8</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">time</span> = pd.date_range<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'2000-01-01'</span>, freq=<span style="color: #E6DB74;">'H'</span>, periods=<span style="color: #AE81FF;">365</span> * <span style="color: #AE81FF;">24</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">9</span><span style="color: #AE81FF;">]</span>: <span style="color: #FD971F;">ds</span> = xr.Dataset<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">{</span><span style="color: #E6DB74;">'foo'</span>: <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">'time'</span>, np.arange<span style="color: #E6DB74;">(</span><span style="color: #AE81FF;">365</span> * <span style="color: #AE81FF;">24</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>, <span style="color: #E6DB74;">'time'</span>: time<span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">]</span>: ds.sel<span style="color: #AE81FF;">(</span>time=<span style="color: #E6DB74;">'2000-01'</span><span style="color: #AE81FF;">)</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.Dataset&gt;
Dimensions:  <span style="color: #AE81FF;">(</span>time: <span style="color: #AE81FF;">744</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * time     <span style="color: #AE81FF;">(</span>time<span style="color: #AE81FF;">)</span> datetime64<span style="color: #AE81FF;">[</span>ns<span style="color: #AE81FF;">]</span> <span style="color: #AE81FF;">2000</span>-<span style="color: #AE81FF;">01</span>-<span style="color: #AE81FF;">01</span> <span style="color: #AE81FF;">2000</span>-<span style="color: #AE81FF;">01</span>-<span style="color: #AE81FF;">01T01</span>:<span style="color: #AE81FF;">00</span>:<span style="color: #AE81FF;">00</span> ...
Data variables:
    foo      <span style="color: #AE81FF;">(</span>time<span style="color: #AE81FF;">)</span> int64 <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">1</span> <span style="color: #AE81FF;">2</span> <span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">6</span> <span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">8</span> <span style="color: #AE81FF;">9</span> <span style="color: #AE81FF;">10</span> <span style="color: #AE81FF;">11</span> <span style="color: #AE81FF;">12</span> <span style="color: #AE81FF;">13</span> <span style="color: #AE81FF;">14</span> <span style="color: #AE81FF;">15</span> <span style="color: #AE81FF;">16</span> <span style="color: #AE81FF;">17</span> <span style="color: #AE81FF;">18</span> <span style="color: #AE81FF;">19</span> ...

In <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">11</span><span style="color: #AE81FF;">]</span>: ds.sel<span style="color: #AE81FF;">(</span>time=<span style="color: #F92672;">slice</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">'2000-06-01'</span>, <span style="color: #E6DB74;">'2000-06-10'</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
Out<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">11</span><span style="color: #AE81FF;">]</span>:
&lt;xarray.Dataset&gt;
Dimensions:  <span style="color: #AE81FF;">(</span>time: <span style="color: #AE81FF;">240</span><span style="color: #AE81FF;">)</span>
Coordinates:
  * time     <span style="color: #AE81FF;">(</span>time<span style="color: #AE81FF;">)</span> datetime64<span style="color: #AE81FF;">[</span>ns<span style="color: #AE81FF;">]</span> <span style="color: #AE81FF;">2000</span>-<span style="color: #AE81FF;">06</span>-<span style="color: #AE81FF;">01</span> <span style="color: #AE81FF;">2000</span>-<span style="color: #AE81FF;">06</span>-<span style="color: #AE81FF;">01T01</span>:<span style="color: #AE81FF;">00</span>:<span style="color: #AE81FF;">00</span> ...
Data variables:
    foo      <span style="color: #AE81FF;">(</span>time<span style="color: #AE81FF;">)</span> int64 <span style="color: #AE81FF;">3648</span> <span style="color: #AE81FF;">3649</span> <span style="color: #AE81FF;">3650</span> <span style="color: #AE81FF;">3651</span> <span style="color: #AE81FF;">3652</span> <span style="color: #AE81FF;">3653</span> <span style="color: #AE81FF;">3654</span> <span style="color: #AE81FF;">3655</span> <span style="color: #AE81FF;">3656</span> <span style="color: #AE81FF;">3657</span> ...
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline57" class="outline-3">
<h3 id="orgheadline57"><span class="section-number-3">7.11</span> Working with pandas</h3>
</div>
<div id="outline-container-orgheadline58" class="outline-3">
<h3 id="orgheadline58"><span class="section-number-3">7.12</span> Serialization and IO</h3>
</div>
<div id="outline-container-orgheadline59" class="outline-3">
<h3 id="orgheadline59"><span class="section-number-3">7.13</span> Out of core computation with dask</h3>
</div>
<div id="outline-container-orgheadline60" class="outline-3">
<h3 id="orgheadline60"><span class="section-number-3">7.14</span> Plotting</h3>
</div>
<div id="outline-container-orgheadline61" class="outline-3">
<h3 id="orgheadline61"><span class="section-number-3">7.15</span> API reference</h3>
</div>
<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62"><span class="section-number-3">7.16</span> xarray Internals</h3>
</div>
</div>
</div>
</body>
</html>
